# Location Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelText..::..Location Property
ModelText Class See Also
---
This property is used to find the physical location of an instance within project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override Location Location { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property Location As Location
	Get
```

Visual C++
---
```text
public:
virtual property Location^ Location {
	Location^ get () override;
}
```

# See Also
ModelText Class
Autodesk.Revit.DB Namespace